{
  "ir_version": "1.0",
  "project": "go-wordpressxml",
  "repository": "https://github.com/grokify/go-wordpressxml",
  "versioning": "semver",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "0.3.5",
      "date": "2025-11-16",
      "changed": [
        { "description": "Update Go module dependencies", "commit": "7251eb5" },
        { "description": "Update CI Go versions", "commit": "168062c" }
      ]
    },
    {
      "version": "0.3.4",
      "date": "2025-03-16",
      "dependencies": [
        { "description": "Bump golangci-lint-action and gocharts dependencies", "commit": "636560c" }
      ]
    },
    {
      "version": "0.3.3",
      "date": "2025-02-16",
      "changed": [
        { "description": "Update Go module dependencies", "commit": "e8340e0" },
        { "description": "Update CI Go versions", "commit": "3ae50e9" },
        { "description": "Update license years", "commit": "04d612c" }
      ],
      "documentation": [
        { "description": "Add golangci-lint badge to README", "commit": "ec95d39" }
      ]
    },
    {
      "version": "0.3.2",
      "date": "2024-12-16",
      "dependencies": [
        { "description": "Update Go module dependencies", "commit": "e326d51" }
      ]
    },
    {
      "version": "0.3.1",
      "date": "2024-07-07",
      "changed": [
        { "description": "Enhance `ItemsToHTML()` output formatting", "commit": "604dc83" }
      ]
    },
    {
      "version": "0.3.0",
      "date": "2024-07-07",
      "highlights": [
        { "description": "HTML export support for WordPress items, contributed by [@Petess](https://github.com/Petess)" }
      ],
      "added": [
        { "description": "HTML export of WordPress items via `ItemsToHTML()`", "commit": "bb35d23", "pr": "114", "author": "@Petess" }
      ],
      "changed": [
        { "description": "Enhance `ItemsToHTML()` output formatting", "commit": "f835956" },
        { "description": "Update Go module dependencies", "commit": "2d82799" }
      ],
      "documentation": [
        { "description": "Update README to include WXR reference", "commit": "f2df02a" },
        { "description": "Update README", "commit": "a4c445e", "pr": "112", "author": "@Petess" }
      ]
    },
    {
      "version": "0.2.2",
      "date": "2024-04-21",
      "dependencies": [
        { "description": "Update Go module dependencies (gocharts, mogo)" }
      ]
    },
    {
      "version": "0.2.1",
      "date": "2023-12-24",
      "dependencies": [
        { "description": "Update Go module dependencies" }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2023-11-04",
      "changed": [
        { "description": "Upgrade to gocharts/v2 module path", "commit": "d5b5c89" }
      ]
    },
    {
      "version": "0.1.7",
      "date": "2023-10-15",
      "changed": [
        { "description": "Update license years", "commit": "853c6bd" }
      ]
    },
    {
      "version": "0.1.6",
      "date": "2023-02-20",
      "changed": [
        { "description": "Add Go toolchain directive to go.mod", "commit": "b9d83ee" },
        { "description": "Update Go module versions", "commit": "1672743" }
      ]
    },
    {
      "version": "0.1.5",
      "date": "2023-01-14",
      "dependencies": [
        { "description": "Update Go module dependencies", "commit": "ece20e3" }
      ]
    },
    {
      "version": "0.1.4",
      "date": "2022-11-14",
      "documentation": [
        { "description": "Update README", "commit": "0949356" }
      ]
    },
    {
      "version": "0.1.3",
      "date": "2022-09-09",
      "dependencies": [
        { "description": "Update Go module dependencies (gocharts, mogo)" }
      ]
    },
    {
      "version": "0.1.2",
      "date": "2022-04-16",
      "added": [
        { "description": "Initialize golangci-lint configuration", "commit": "93f46c4" },
        { "description": "Add Go 1.18 to CI matrix", "commit": "dbe684b" }
      ],
      "changed": [
        { "description": "Upgrade to gocharts/v2 module path", "commit": "d5b5c89" },
        { "description": "Fix golangci-lint issues", "commit": "82a1ef0" }
      ],
      "build": [
        { "description": "Initialize Go modules", "commit": "4f6e773" }
      ]
    },
    {
      "version": "0.1.1",
      "date": "2021-12-13",
      "changed": [
        { "description": "Update GitHub Actions workflow", "commit": "fabeba7" },
        { "description": "Update Go module dependencies", "commit": "df77951" }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2021-10-26",
      "highlights": [
        { "description": "Initial tagged release with WordPress XML (WXR) parsing and Hugo conversion support" }
      ],
      "added": [
        { "description": "WordPress XML (WXR) file parsing with `ReadFileWXR()`", "commit": "bbb9a50" },
        { "description": "Hugo post conversion from WordPress exports", "commit": "3f19146" },
        { "description": "Post.Id and Post.Comments fields from [@amanessinger](https://github.com/amanessinger)", "commit": "7006d4f", "author": "@amanessinger" },
        { "description": "Category parsing support", "commit": "ec15986" },
        { "description": "GitHub Actions CI workflow", "commit": "c68e594" }
      ]
    }
  ]
}
